////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//  타임세일 설정
//
//  상품등록 - 상품관리 > 상품관리 > 메인상품 진열관리 > TIME SALE 에 상품을 넣으시면 되겠습니다.
//  시간등록 - 아래의 시간설정에서 등록된 상품 순서대로 시간 설정을 해주시면 되겠습니다.
//             box1이 첫번째 상품, box2는 두번째 상품입니다.
//  서버의 과부하로 6번상품까지만 허용되겠습니다.
//  24시 종료는 23:59:59 로 설정해주시기 바랍니다. 익스플로러, 사파리에선 24시가 인식이 되지 않습니다.
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////

	// 시간설정 : 'ready(시작일)년-월-일 시:분:초', 'dday(종료일)년-월-일 시:분:초'

    //1번 상품
	$('.box1').d_DDay({ready:'2025-08-10 14:47:00', dday:'2027-12-20 17:30:00'});

    //2번 상품
	$('.box2').d_DDay({ready:'2025-12-10 14:47:00', dday:'2027-12-20 17:30:00'});

    //3번 상품
	$('.box3').d_DDay({ready:'2018-02-20 14:47:00', dday:'2025-08-30 14:20:00'});

    //4번 상품
	$('.box4').d_DDay({ready:'2018-02-20 14:47:00', dday:'2025-12-10 19:30:00'});

    //5번 상품
	$('.box5').d_DDay({ready:'2018-02-20 14:47:00', dday:'2025-12-10 19:30:00'});

    //6번 상품
	$('.box6').d_DDay({ready:'2015-05-20 14:47:00', dday:'2015-12-20 12:00:00'});

    //7번 상품
	$('.box7').d_DDay({ready:'2015-05-20 14:47:00', dday:'2015-12-20 12:00:00'});

    //8번 상품
	$('.box8').d_DDay({ready:'2015-05-20 14:47:00', dday:'2015-12-20 12:00:00'});

    //9번 상품
	$('.box9').d_DDay({ready:'2015-05-20 14:47:00', dday:'2015-12-20 12:00:00'});