function onoffLoad(){
    const classStatus = {
/***********************************************************************************************************

    ### 디자인 ON/OFF 설정 ###

    • 수정전 반드시 백업 또는 스킨 복사를 해두시기 바랍니다.
    • "디자인명": "사용함" 또는 "사용안함" 으로 디자인을 선택적으로 사용할 수 있습니다.
    • 아래 내용에 없는 부분은 HTML/CSS에서 직접 수정하셔야되겠습니다.
    • ★★★상품이 진열된 곳은 상품을 진열 안하시면 노출되지 않습니다.★★★A
    
***********************************************************************************************************/      
        
//////// 상단 디자인 //////////////////////////////////////////////////////////////////////////////////////
        "cp507": "사용안함", 						//최상단 슬라이드배너
        "JS_multiBtn": "사용함", 					//멀티쇼핑몰 버튼
        "cp595": "사용안함", 						//SNS아이콘
        "topmenuLeft": "사용함",                                        //좌측메뉴
        "JS_topMenu": "사용함", 					//우측메뉴
        "cp502": "사용함", 						//슬라이드배너
        "header_search": "사용함", 				//검색창
        "categoryAll": "사용함", 					//카테고리전체보기
        "categorySub comm": "사용함", 				//카테고리전체보기 > 커뮤니티
        "categorySub etc": "사용안함", 				//카테고리전체보기 > 기타메뉴
        "categorySub m01": "사용안함", 				//추가메뉴1(WE ARE)
        "product_category": "사용함", 				//상품분류
        "categorySub m02": "사용안함", 				//추가메뉴2(ETC 2)
        "etc2_cso": "사용안함",                                 //추가메뉴2(ETC 2) 모바일스크롤메뉴
        "categorySub m03": "사용함", 				//타임세일/브랜드/포토후기
        "categorySub m04": "사용함", 				//기획전(Exhibition)

        
//////// 쇼핑몰 메인 //////////////////////////////////////////////////////////////////////////////////////
        "cp560": "사용함", 						//메인분류메뉴
        "cp301": "사용함", 				    	//공지사항라인
        "cp802": "사용안함", 				    	//핫 해시태그
        "cp307": "사용안함", 				    	//배너+슬라이드배너
        "cp525": "사용함", 						//텝-이번주 잘나가는 아이템7
        "cp012": "사용안함", 				    	//배너12
        "cp530": "사용함", 				    	//판매자 추천상품 MD's PICK
        "cp515": "사용안함", 				    	//슬라이드 배너
        "cp508": "사용안함", 				    	//와이드 슬라이드배너
        "cp574": "사용함", 				    	//타임세일
        "cp576": "사용함", 				    	//포토리뷰
        
        
//////// 상품목록 ////////////////////////////////////////////////////////////////////////////////////////
        "dc_rate": "사용함", 						//할인율
        "-likeButton": "사용함", 					//좋아요
        "list_button": "사용함", 					//이미지내부 아이콘
        "xans-product-imagestyle": "사용함", 		//꾸미기 아이콘

        
//////// 하단 디자인 //////////////////////////////////////////////////////////////////////////////////////
        "cp920": "사용안함", 				    	//인스타그램
        "cp005": "사용안함", 				    	//하단배너
        "oper_time": "사용함", 					//고객센터안내
        "bank_info": "사용안함", 				//입금계좌안내
        "ft_produce": "사용안함", 				//인쇄제작안내
        "footer_delivery": "사용함", 				//배송안내
        "footer_company": "사용함", 				//회사정보
        "footer_escrow": "사용함", 				//매안전서비스
        "footer_ico": "사용함", 					//하단 아이콘

        
//////// 좌측 하단 디자인 /////////////////////////////////////////////////////////////////////////////////
        "cp705": "사용안함", 				    	//멀티팝업
        "cp701": "사용안함", 				    	//인트로팝업
        "cp703": "사용안함", 				    	//스마트팝업

        
//////// 좌측 디자인 //////////////////////////////////////////////////////////////////////////////////////
        "left_customer": "사용함", 				//고객센터안내
        "counselBtn": "사용함", 				//상담버튼
        "JS_faq": "사용안함", 				    	//자주묻는 질문 - FAQ
        "JS_community": "사용함", 				//커뮤니티
        "leftMenu": "사용안함", 				    	//좌측메뉴

        
//////// 우측 패널 ////////////////////////////////////////////////////////////////////////////////////////
        "cp550": "사용함", 				    	//우측버튼전체
        "cp793": "사용함", 				    	//우측버튼 > 패널열기
        "switch-button": "사용안함", 				//우측버튼 > 화면모드
        "cp797": "사용함", 				    	//우측버튼 > 상세검색
        "p_naverTalk": "사용함", 				//우측버튼 > 네이버톡톡
        "p_kakaoCh": "사용함", 					//우측버튼 > 카카오톡
        "updown": "사용함", 				    	//우측버튼 > 상하단
        "cp793_slide": "사용안함", 				//패널 > 슬라이드배너
        "cp793_bnr": "사용안함", 				//패널 > 배너
        "793_menu": "사용함", 					//패널 > 메뉴
        "cp793_customer": "사용함", 				//패널 > 고객센터안내
        "cp793_bank": "사용함", 				//패널 > 입금계좌안내
        
        
//////// 상품상세 ////////////////////////////////////////////////////////////////////////////////////////
        "cp582": "사용안함", 				    	//유튜브 버튼
        "cp513": "사용안함", 				    	//상세페이지 슬라이드배너
        "xans-product-addproduct": "사용함", 		        //추가구성상품
        "snsIco": "사용안함", 				   		//SNS 공유버튼(카카오, 페이스북, 트위터)
        "etcBtn_01": "사용안함", 					//폼메일상담 버튼
        "etcBtn_02": "사용안함", 					//추천메일 보내기 버튼
        "etcBtn_03": "사용안함", 					//상품조르기 버튼
        "etcBtn_04": "사용안함", 					//대량구매문의 버튼
        "cp522": "사용안함", 				    	//회원등급별 혜택안내
        "eventArea": "사용함", 					//이벤트
        "detail_coupon": "사용함", 				//할인쿠폰 다운로드
        "cp535": "사용함", 				    	//관련상품
        "btn-buy-open": "사용함", 					//구매하기 버튼(따라다니는)
        "img_info img1": "사용안함", 				//상단정보이미지
        "img_info img2": "사용함", 				//하단정보이미지
        

//////// 커뮤니티 ////////////////////////////////////////////////////////////////////////////////////////
        "board_part xans-board-1": "사용함", 		//공지사항 (ID=1)
        "board_part xans-board-3": "사용함", 		//이용안내FAQ (ID=3)
        "board_part xans-board-4": "사용함", 		//상품후기 (ID=4)
        "board_part xans-board-6": "사용함", 		//상품문의 (ID=6)
        "board_part xans-board-8": "사용함", 		//갤러리 (ID=1)
        "board_part xans-board-1002": "사용함",	//자유게시판2 (ID=1)

        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        
//이하 수정금지 /////////////////////////////////////////////////////////////////////////////////////////////
	};
    for (const className in classStatus) {
      const status = classStatus[className];
      if (status === "사용안함") {
        const elements = document.getElementsByClassName(className);
        Array.from(elements).forEach(element => {
            element.style.display = "none"; // 숨기기
        });
      }else{
          // 사용함 
      }
    }
}
document.addEventListener('DOMContentLoaded', () => {
    onoffLoad();
});